Extensions/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПеремещениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НомерНД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроектПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>IDНД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроектОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаКонечныйПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументПеремещенияВТранзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЧерезТранзитныйСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПеремещенияИзТранзита</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Проект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроектОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоВДороге</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроектПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>AzRyЯчейкаПолучатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПараметрыВнеоборотныхАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыСтруктурныхЕдиниц</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Розница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/СтатусыПартий/СтатусыПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПартий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СобственныеЗапасы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветственноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДавальческоеСырье</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТоварыНаКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ПеремещениеЗапасов/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации КАК ВидОперации,
	|	ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницу,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозвратИзРозницыСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницеСуммовойУчет,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаВРознице КАК СчетУчетаВРозницеПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаНаценки КАК СчетУчетаНаценкиПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеПолучательРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиПолучательРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен КАК РозничныйВидЦенПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦеныПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад КАК КоррОрдерныйСклад,
	//+++ Дмгг
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета КАК ТипСчетаЗатрат,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатрат,
	//--- Дмгг
	|	ПеремещениеЗапасовЗапасы.Ссылка.НаправлениеДеятельности КАК КоррНаправлениеДеятельности,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектПолучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПроект,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК КоррСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ПоложениеЯчейкиВПеремещенииЗапасов = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ячейка
	|	КОНЕЦ КАК Ячейка,
	// +++ { AzRy - [01.06.2022] - Jira:ERPM-865 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	//|	ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК КоррЯчейка,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ПоложениеЯчейкиВПеремещенииЗапасов = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.AzRyЯчейкаПолучатель
	|	КОНЕЦ КАК КоррЯчейка,	
	// +++ } AzRy - [01.06.2022] - Jira:ERPM-865 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК КоррСчетУчета,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|	КОНЕЦ КАК КоррСчетУчетаРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге 
	|		ИНАЧЕ (ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге) * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Резерв
	|					ИНАЧЕ ПеремещениеЗапасовЗапасы.Резерв * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Резерв,
	|	0 КАК Сумма,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	&ПеремещениеЗапасов КАК Содержание,
	|	&ПеремещениеЗапасов КАК СодержаниеПроводки,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК СуммаВозвратВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК КоличествоВДороге,
	|	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.ВнутреннийЗаказ) КАК ЗаказНаПеремещения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ДатаПеремещенияИзТранзита КАК ДатаПеремещенияИзТранзита,
	|	ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив КАК Имущество,
	|	ЛОЖЬ КАК ПрименитьВТекущемМесяце,
	|	ВложенныйЗапрос.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК ПодразделениеОС,
	|	ВложенныйЗапрос.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ВложенныйЗапрос.Адрес КАК Адрес,
	|	&ДатаОбновленияНаРелиз_1_2_1 КАК ДатаОбновленияНаРелиз_1_2_1
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|			ВЫРАЗИТЬ(ПараметрыВнеоборотныхАктивовСрезПоследних.Адрес КАК СТРОКА(250)) КАК Адрес
	|		ИЗ
	|			РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаДокумента, Регистратор <> &Ссылка) КАК ПараметрыВнеоборотныхАктивовСрезПоследних) КАК ВложенныйЗапрос
	|		ПО ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив = ВложенныйЗапрос.ВнеоборотныйАктив
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|	И ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации,
	|	ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.РозничныйВидЦен.ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета,
	|	ПеремещениеЗапасовЗапасы.Ссылка.НаправлениеДеятельности,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектПолучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ПоложениеЯчейкиВПеремещенииЗапасов = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ячейка
	|	КОНЕЦ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|	КОНЕЦ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл,
	|	ПеремещениеЗапасовЗапасы.Номенклатура,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Резерв
	|					ИНАЧЕ ПеремещениеЗапасовЗапасы.Резерв * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ПеремещениеЗапасовЗапасы.Сумма,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	&ПеремещениеЗапасов,
	|	&ПеремещениеЗапасов,
	|	ПеремещениеЗапасовЗапасы.Сумма,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.ВнутреннийЗаказ),
	|	ПеремещениеЗапасовЗапасы.Ссылка.ДатаПеремещенияИзТранзита,
	|	ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив,
	|	ЛОЖЬ,
	|	ВложенныйЗапрос.СрокИспользованияДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатрат,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтоимостьДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатратРегл,
	|	ВложенныйЗапрос.Адрес,
	|	&ДатаОбновленияНаРелиз_1_2_1
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|			ВЫРАЗИТЬ(ПараметрыВнеоборотныхАктивовСрезПоследних.Адрес КАК СТРОКА(250)) КАК Адрес
	|		ИЗ
	|			РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаДокумента, Регистратор <> &Ссылка) КАК ПараметрыВнеоборотныхАктивовСрезПоследних) КАК ВложенныйЗапрос
	|		ПО ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив = ВложенныйЗапрос.ВнеоборотныйАктив
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|	И ПеремещениеЗапасовЗапасы.КоличествоВДороге <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовСерийныеНомера.КлючСвязи,
	|	ПеремещениеЗапасовСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ПеремещениеЗапасов.СерийныеНомера КАК ПеремещениеЗапасовСерийныеНомера
	|ГДЕ
	|	ПеремещениеЗапасовСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ ПеремещениеЗапасовСерийныеНомера.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ДатаДокумента", ДокументСсылкаПеремещениеЗапасов.Дата);
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	// Временно: изменение движений по ордерному складу.
	Запрос.УстановитьПараметр("ДатаОбновленияНаРелиз_1_2_1", Константы.ДатаОбновленияНаРелиз_1_2_1.Получить());
		
	Запрос.УстановитьПараметр("ПеремещениеЗапасов", НСтр("en='Stock Transfer';ka='მარაგების გადაადგილება';ru='Перемещение запасов'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ Дмгг

	
	МассивРезультатов = Запрос.Выполнить();
		
	// Формирование проводок документа.
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);	
	
	СформироватьТаблицаУправленческий(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	//Паганини_
	СформироватьТаблицаЗаказНаПеремещение(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	//_Паганини
		
	// Расчет стоимости списания запасов.
	СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		
КонецПроцедуры
